{
  "HOME": "Home",
  "ABOUT": "About",
  "PROJECTS": "Projects",
  "SKILLS": "Skills",
  "CERTIFICATES": "Certificates",
  "HOBBIES": "In my free time, I enjoy playing sports, reading books, playing video games, watching TV shows and coding side projects.",
  "CV_DOWNLOAD": "Download my CV",
  "COVER_LETTER_DOWNLOAD": "Download my cover letter",
  "HOME_GITHUB": "GitHub account",
  "HOME_LINKEDIN": "LinkedIn account",
  "HOME_HELLO": "Hello! I'm Szakacsi Ferenc-Adam.",
  "HOME_WELCOME": "Welcome to my personal website.",
  "HOME_ABOUT": "Dedicated and enthusiastic software developer with a deep passion for continuous selfimprovement. My professional journey is driven by a desire to excel in both soft and hard skills while fostering productive collaborations with colleagues. I firmly believe that great software development extends beyond code; it's about teamwork, communication, and adaptability.",
  "HOME_EXPERIENCE": "I worked as a full stack software developer for almost 2 years. I have experience in developing web applications, mobile applications and desktop applications.",
  "HOME_EDUCATION": "I have a background in computer science and hold a bachelor's degree from Universiatea din Oradea. Currently doing my master's degree in computer software engineering.",
  "ABOUT_ABOUT": "About me",
  "ABOUT_WORK": "Work experience",
  "ABOUT_EXPERIENCE": "As a Software Developer at DevNest and Climarol Prest, I have gained experience in diverse areas of software development for the past 2 years. I have worked on various projects, from building and maintaining web applications to improving the efficiency of existing systems.",
  "ABOUT_EDUCATION_TITLE": "Education",
  "ABOUT_EDUCATION": "I graduated with a Bachelor's degree in Computer Science from Universitatea din Oradea. Currently pursuing there my Master's degree in Software engineering. My academic journey has taught me critical skills in problem-solving, teamwork, and adaptability.",
  "ABOUT_HOBBIES": "Hobbies",
  "ABOUT_SKILLS_LIST": "Below is a list of the technologies I have used in my projects:",
  "ABOUT_SKILLS_LINK1": "For more detailed information on my acquired skills, you can check out the ",
  "ABOUT_SKILLS_LINK2": " section of the site.",
  "ABOUT_PROJECTS_LINK1": "Throughout my university and professional career, I have worked on several projects. For more detailed information, you can check out the ",
  "ABOUT_PROJECTS_LINK2": " section of the site.",
  "ABOUT_CERTIFICATES_LINK1": "Throughout my educational and professional career, I have acquired several certificates. For more detailed information, you can check out the ",
  "ABOUT_CERTIFICATES_LINK2": " section of the site.",
  "ABOUT_INTEREST": "Getting interested?",
  "ABOUT_INTEREST_DOWNLOAD": "In that case, let's get in touch!",
  "PROJECTS_TEXT1": "Here are some of the projects I have worked on.",
  "PROJECTS_TEXT2": "Each card contains the project's name, description and the technologies used.",
  "PROJECTS_TEXT3": "Clicking on their name will redirect you to their respective GitHub repository.",
  "PROJECTS_DESCRIPTION1": "My personal portfolio website built with TypeScript, React and Tailwind CSS.",
  "PROJECTS_DESCRIPTION2": "Boiler management app built with MERN stack.",
  "PROJECTS_DESCRIPTION3": "Football data visualization written in Python.",
  "PROJECTS_DESCRIPTION4": "Tic-tac-toe game built with Vite, Svelte and TypeScript.",
  "PROJECTS_DESCRIPTION5": "Burned calories tracker written with Vite, Vue and TypeScript.",
  "PROJECTS_DESCRIPTION6": "Quiz show game written in JavaScript, HTML, and CSS.",
  "PROJECTS_DESCRIPTION7": "Python apps that draw shapes of their own choosing.",
  "PROJECTS_DESCRIPTION8": "C# app comparing the performance of sorting algorithms.",
  "PROJECTS_DESCRIPTION9": "Code challenges in Java.",
  "PROJECTS_DESCRIPTION10": "Tasks I did during my university years.",
  "SKILLS_TEXT1": "I have worked on various projects, from building and maintaining full-stack applications to improving the efficiency of existing systems.",
  "SKILLS_TEXT2": "Below are the technologies I had the pleasure of working with during my time in the industry.",
  "SKILLS_TEXT3": "Click on the icons to learn more about my experience with each one of them.",
  "FOOTER_COPYRIGHT1": "Copyright",
  "FOOTER_COPYRIGHT2": "All rights reserved."
}
