{
  "HOME": "Home",
  "ABOUT": "About",
  "PROJECTS": "Projects",
  "SKILLS": "Skills",
  "CERTIFICATES": "Certificates",
  "HOBBIES": "In my free time, I enjoy playing sports, reading books, playing video games, watching TV shows and coding side projects.",
  "CV_DOWNLOAD": "My CV",
  "COVER_LETTER_DOWNLOAD": "My cover letter",
  "HOME_GITHUB": "GitHub account",
  "HOME_LINKEDIN": "LinkedIn account",
  "HOME_HELLO": "Hello! I'm Szakacsi Ferenc-Adam.",
  "HOME_WELCOME": "Welcome to my personal website.",
  "HOME_ABOUT": "Dedicated and enthusiastic software developer with a deep passion for continuous self-improvement. My professional journey is driven by a desire to excel in both soft and hard skills while fostering productive collaborations with colleagues. I firmly believe that great software development extends beyond code; it's about teamwork, communication, and adaptability.",
  "HOME_EXPERIENCE": "I work as a full stack software developer for over 2 years now, developing web, mobile, and desktop applications. Throughout my work so far, I utilized Agile methodologies to ensure adaptability and timely delivery of features. I consistently maintained the highest coding and testing standards, focusing on writing reliable, scalable, and well-tested code to deliver high-quality applications across platforms.",
  "HOME_EDUCATION": "I have a background in computer science and hold a bachelor's degree from Universitatea din Oradea. I am currently pursuing my master's degree in computer software engineering.",
  "ABOUT_ABOUT": "About me",
  "ABOUT_WORK": "Work experience",
  "ABOUT_EXPERIENCE": "As a Software Developer at DevNest and Climarol Prest, I accumulated over 2 years of professional experience across multiple areas of software development. My work involved developing and maintaining complex web applications, ensuring their scalability, performance, and cross-browser compatibility. I contributed to full stack projects, using modern technologies such as React, TypeScript, JavaScript, HTML, and CSS on the frontend, and ASP.NET and Node.js on the backend. In addition to building new applications, I focused on optimizing existing systems to enhance their efficiency, implementing performance improvements, refactoring codebases for maintainability, and integrating automated testing frameworks to improve code reliability. By adhering to Agile methodologies, I collaborated closely with cross-functional teams to deliver features that met both user needs and business objectives. These experiences shaped my skills in both front-end and back-end development, database management, API creation, and efficient problem-solving, positioning me as a versatile and adaptable developer.",
  "ABOUT_EDUCATION_TITLE": "Education",
  "ABOUT_EDUCATION": "I graduated with a Bachelor's degree in Computer Science from Universitatea din Oradea. Currently pursuing my Master's degree in Software engineering. My academic journey has taught me critical skills in problem-solving, teamwork, and adaptability.",
  "ABOUT_LANGUAGES_TITLE": "Spoken languages",
  "ABOUT_LANGUAGES": "I speak Hungarian and Romanian at a native level, and I speak English at a C2 level, certified by the CAE diploma.",
  "ABOUT_HOBBIES": "Hobbies",
  "ABOUT_SKILLS_LIST": "Below is a list of the technologies I have used in my projects:",
  "ABOUT_SKILLS_LINK1": "For more detailed information on my acquired skills, you can check out the ",
  "ABOUT_SKILLS_LINK2": " section of the site.",
  "ABOUT_PROJECTS_LINK1": "Throughout my university and professional career, I have worked on several projects. For more detailed information, you can check out the ",
  "ABOUT_PROJECTS_LINK2": " section of the site.",
  "ABOUT_CERTIFICATES_LINK1": "Throughout my educational and professional career, I have acquired several certificates. For more detailed information, you can check out the ",
  "ABOUT_CERTIFICATES_LINK2": " section of the site.",
  "ABOUT_INTEREST": "Getting interested?",
  "ABOUT_INTEREST_DOWNLOAD": "In that case, let's get in touch!",
  "PROJECTS_TEXT1": "Here are some of the projects I have worked on.",
  "PROJECTS_TEXT2": "Each card contains the project's name, description and the technologies used.",
  "PROJECTS_TEXT3": "Clicking on their name will redirect you to their respective GitHub repository.",
  "PROJECTS_DESCRIPTION1": "My personal portfolio website built with TypeScript, React and Tailwind CSS.",
  "PROJECTS_DESCRIPTION2": "Boiler management app built with MERN stack.",
  "PROJECTS_DESCRIPTION3": "Football data visualization written in Python.",
  "PROJECTS_DESCRIPTION4": "Tic-tac-toe game built with Vite, Svelte and TypeScript.",
  "PROJECTS_DESCRIPTION5": "Burned calories tracker app written with Vite, Vue and TypeScript.",
  "PROJECTS_DESCRIPTION6": "Quiz show game written in JavaScript, HTML, and CSS.",
  "PROJECTS_DESCRIPTION7": "Python apps that draw shapes of their own choosing.",
  "PROJECTS_DESCRIPTION8": "C# app comparing the performance of sorting algorithms.",
  "PROJECTS_DESCRIPTION9": "Code challenges in Java.",
  "PROJECTS_DESCRIPTION10": "Tasks I did during my university years.",
  "SKILLS_TEXT1": "I have worked on various projects, from building and maintaining full-stack applications to improving the efficiency of existing systems.",
  "SKILLS_TEXT2": "Below are the technologies I had the pleasure of working with during my time in the industry.",
  "SKILLS_TEXT3": "Click on the icons to learn more about my experience with each one of them.",
  "SKILLS_JS": "JavaScript is used to create dynamic and interactive functionality on web pages, enabling client-side behaviors. I used it for developing interactive web applications like dynamic forms, real-time updates, and engaging user interfaces.",
  "SKILLS_HTML": "HTML provides the basic structure of web pages by defining elements like headings, paragraphs, and forms. I used it to build the foundation of various websites, from simple blogs to multi-page applications with complex structures.",
  "SKILLS_CSS": "CSS is used to style and visually format HTML content, including layout, colors, and fonts. I used it to create responsive, visually appealing web pages for projects such as marketing websites and portfolio sites.",
  "SKILLS_TS": "TypeScript adds static types to JavaScript, making code more predictable and easier to debug, especially in large projects. I used it for building large-scale web applications where maintainability and scalability were critical, like enterprise dashboards or e-commerce platforms.",
  "SKILLS_REACT": "React is used to build user interfaces with reusable components and manage state efficiently in web applications. I used it for developing single-page applications (SPAs) such as dashboards, social platforms, or client-side form-heavy applications.",
  "SKILLS_TAILWIND": "Tailwind is a utility-first CSS framework that allows developers to style applications by applying predefined classes directly in HTML. I used it to quickly design custom interfaces for projects like SaaS apps and landing pages, where fast development and a modern look were important.",
  "SKILLS_NEXT": "Next.js is a React-based framework that provides server-side rendering and static site generation. I used it to build websites and web applications for the web and mobile platforms.",
  "SKILLS_NODE": "Node enables server-side JavaScript execution, allowing developers to build backend services and APIs using JavaScript. I used it to build server-side applications like RESTful APIs, real-time chat apps, and backend services for web applications.",
  "SKILLS_EXPRESS": "Express is a web application framework for Node.js, used to create APIs and handle server-side routing. I used it to build back-end services and develop RESTful APIs for web and mobile applications.",
  "SKILLS_NET": ".NET is a free, cross-platform framework developed by Microsoft for building various types of applications, including web, mobile, desktop, and cloud solutions. I used it to build scalable backend services and APIs, leveraging its capabilities for web and cloud-based applications.",
  "SKILLS_MONGO": "MongoDB is a NoSQL database used for storing and retrieving unstructured data in a flexible, JSON-like format. I used it in projects that needed high scalability and flexibility, such as content management systems and e-commerce platforms.",
  "SKILLS_MYSQL": "MySQL is an open-source relational database management system known for its speed, reliability, and ease of use. I utilized it in projects requiring efficient data retrieval and scalability, especially for applications with high read-to-write ratios.",
  "SKILLS_POSTGRE": "PostgreSQL is an open-source relational database management system that offers advanced features like transaction handling and data consistency. I used it in projects where complex data structures and handling large volumes of data were required.",
  "SKILLS_JEST": "Jest is a testing framework used to write unit tests for JavaScript and TypeScript applications, ensuring code behaves as expected. I used it to write tests for large projects to ensure the reliability and correctness of critical business logic.",
  "SKILLS_JENKINS": "Jenkins is a continuous integration server that automates the build and deployment process. I utilized Jenkins to set up CI/CD pipelines for automating tests, building, and deploying React and ASP.NET Core applications.",
  "SKILLS_SONAR": "SonarQube analyzes code quality by identifying bugs, vulnerabilities, and code smells. I implemented SonarQube in projects to maintain code quality and ensure best practices were followed in both frontend and backend development.",
  "SKILLS_JIRA": "Jira is a project management tool used for tracking tasks, bugs, and progress in software development projects. I used it to manage sprints, track issues, and collaborate with my team on larger, ongoing software development projects.",
  "SKILLS_FIGMA": "Figma is a collaborative design tool used for creating wireframes, prototypes, and UI designs for web and mobile apps. I used it to collaborate with designers, review prototypes, and ensure the front-end implementation matched the intended design.",
  "SKILLS_GIT": "Git is a version control system that tracks changes in code, enabling collaboration and version management. I used it in all my software projects to manage version control, collaborate with other developers, and track changes over time.",
  "SKILLS_GITHUB": "GitHub is a platform for hosting Git repositories, facilitating code sharing, collaboration, and project management. I used it to share code, manage pull requests, and collaborate on both open-source and private team projects.",
  "SKILLS_GITLAB": "GitLab is an alternative to GitHub, offering Git repository hosting with integrated CI/CD pipelines and project management features. I used it in DevOps-focused projects where continuous integration and delivery (CI/CD) were important for automation and deployment.",
  "SKILLS_BUTTON": "Close",
  "CERTIFICATES_TEXT": "Below are the certifications acquired so far in my academic career.",
  "CERTIFICATES_CAE_TITLE": "Cambridge Advanced English Certificate",
  "CERTIFICATES_MOD_TITLE": "Teaching Module Diploma",
  "CERTIFICATES_COM_TITLE": "Collegium Varadinum Scientific Student Conference Commendation",
  "CERTIFICATES_SOL1_TITLE": "SoloLearn ReactJS Certificate",
  "CERTIFICATES_SOL2_TITLE": "SoloLearn JavaScript Certificate",
  "CERTIFICATES_SOL3_TITLE": "SoloLearn HTML Certificate",
  "CERTIFICATES_SOL4_TITLE": "SoloLearn CSS Certificate",
  "CERTIFICATES_SOL5_TITLE": "SoloLearn C# Certificate",
  "CERTIFICATES_SOL6_TITLE": "SoloLearn Java Certificate",
  "CERTIFICATES_SOL7_TITLE": "SoloLearn Python Certificate",
  "CERTIFICATES_SOL8_TITLE": "SoloLearn SQL Certificate",
  "CERTIFICATES_CAE": "Certificate awarded upon successful completion of the Cambridge Advanced English course.",
  "CERTIFICATES_MOD": "Certificate awarded upon successful completion of the national teaching module.",
  "CERTIFICATES_COM": "Commendation awarded upon succesful presentation of the conducted research in the subject of AI and its effects on society.",
  "CERTIFICATES_SOL1": "Certificate awarded upon successful completion of the SoloLearn ReactJS course.",
  "CERTIFICATES_SOL2": "Certificate awarded upon successful completion of the SoloLearn JavaScript course.",
  "CERTIFICATES_SOL3": "Certificate awarded upon successful completion of the SoloLearn HTML course.",
  "CERTIFICATES_SOL4": "Certificate awarded upon successful completion of the SoloLearn CSS course.",
  "CERTIFICATES_SOL5": "Certificate awarded upon successful completion of the SoloLearn C# course.",
  "CERTIFICATES_SOL6": "Certificate awarded upon successful completion of the SoloLearn Java course.",
  "CERTIFICATES_SOL7": "Certificate awarded upon successful completion of the SoloLearn Python course.",
  "CERTIFICATES_SOL8": "Certificate awarded upon successful completion of the SoloLearn SQL course.",
  "FOOTER_COPYRIGHT1": "Copyright",
  "FOOTER_COPYRIGHT2": "All rights reserved."
}
