{
  "HOME": "Otthon",
  "ABOUT": "Rólam",
  "PROJECTS": "Projektek",
  "SKILLS": "Képessegek",
  "CERTIFICATES": "Diplomák",
  "HOBBIES": "Szabadidőmben szeretek sportolni, könyveket olvasni, videojátékokkal játszani, tévéműsorokat nézni és mellékprojekteket fejleszteni.",
  "CV_DOWNLOAD": "Töltse le az önéletrajzomat",
  "COVER_LETTER_DOWNLOAD": "Töltse le a motivációs levelemet",
  "HOME_GITHUB": "GitHub fiók",
  "HOME_LINKEDIN": "LinkedIn fiók",
  "HOME_HELLO": "Helló! Szakácsi Ferenc-Ádám vagyok.",
  "HOME_WELCOME": "Üdvözlöm a személyes weboldalamon.",
  "HOME_ABOUT": "Elkötelezett és lelkes szoftverfejlesztő, aki mély szenvedélyt érez a folyamatos önfejlesztés iránt. Szakmai utamat az a vágy vezérli, hogy a szükséges készségek terén kiemelkedő teljesítményt nyújtsak, miközben elősegítem a kollégákkal való produktív együttműködést. Szilárdan hiszem, hogy a nagyszerű szoftverfejlesztés túlmegy a kódon; a csapatmunkáról, a kommunikációról és az alkalmazkodóképességről szól.",
  "HOME_EXPERIENCE": "Két évig dolgoztam full stack szoftverfejlesztőként, ahol web-, mobil- és asztali alkalmazásokat fejlesztettem. Munkám során az Agile módszertanokat használtam annak érdekében, hogy rugalmasan alkalmazkodjak a változó követelményekhez és időben szállítsam a funkciókat. Mindig a legmagasabb kódolási és tesztelési szabványokat tartottam fenn, megbízható, skálázható és jól tesztelt kódot írva, hogy minőségi alkalmazásokat szállítsak minden platformon.",
  "HOME_EDUCATION": "Számítástechnikai háttérrel rendelkezem, és a Nagyváradi Egyetemen (Universitatea din Oradea) szereztem alapképzési diplomát. Jelenleg mesterdiplomát szerzek számítógépes szoftverfejlesztésből.",
  "ABOUT_ABOUT": "Rólam",
  "ABOUT_WORK": "Munkahelyi tapasztalat",
  "ABOUT_EXPERIENCE": "Szoftverfejlesztőként a DevNestnél és a Climarol Prestnél több mint 2 éves tapasztalatra tettem szert a szoftverfejlesztés különböző területein. Munkám során komplex webalkalmazásokat fejlesztettem és tartottam karban, biztosítva azok skálázhatóságát, teljesítményét és böngésző-kompatibilitását. Full stack projektekben vettem részt, modern technológiákat használva, mint például React, TypeScript, JavaScript, HTML és CSS a frontend, valamint ASP.NET és Node.js a backend fejlesztésekhez. Az új alkalmazások építése mellett a meglévő rendszerek hatékonyságának növelésére is összpontosítottam, teljesítményjavításokat valósítottam meg, a kódbázisokat karbantarthatóság céljából refaktoráltam, és automatizált tesztelési keretrendszereket integráltam a kód megbízhatóságának javítása érdekében. Az Agile módszertanok követésével szorosan együttműködtem a különböző funkcionális csapatokkal, hogy olyan funkciókat szállítsunk, amelyek mind a felhasználói igényeknek, mind az üzleti céloknak megfelelnek. Ezek a tapasztalatok fejlesztették front-end és back-end fejlesztési képességeimet, adatbázis-kezelési, API létrehozási és hatékony problémamegoldási képességeimet, így egy sokoldalú és alkalmazkodó fejlesztővé váltam.",
  "ABOUT_EDUCATION_TITLE": "Tanulmányok",
  "ABOUT_EDUCATION": "A Nagyváradi egyetem informatika szakán szereztem alapképzést. Jelenleg ugyanott veszek részt szoftvermérnöki mesterképzésben. A tanulmányi utam során a problémamegoldás, a csapatmunka és az alkalmazkodóképesség terén szereztem kritikus készségeket.",
  "ABOUT_LANGUAGES_TITLE": "Beszélt nyelvek",
  "ABOUT_LANGUAGES": "Magyarul és románul anyanyelvi szinten beszélek, angolul pedig C2 szinten, CAE diplomával igazolva.",
  "ABOUT_HOBBIES": "Hobbik",
  "ABOUT_SKILLS_LIST": "Az alábbiakban felsorolva megtalálja az általam a projektjeimben használt technológiákat:",
  "ABOUT_SKILLS_LINK1": "Ha részletesebb információt szeretne kapni a megszerzett képességeimről, akkor nézze meg a ",
  "ABOUT_SKILLS_LINK2": " oldalat.",
  "ABOUT_PROJECTS_LINK1": "Egyetemi és szakmai pályafutásom során számos projekten dolgoztam. Részletesebb információért, kérem kattintson a ",
  "ABOUT_PROJECTS_LINK2": " oldalra.",
  "ABOUT_CERTIFICATES_LINK1": "Oktatási és szakmai pályafutásom során számos bizonyítványt szereztem. Ha részletesebb információt szeretne kapni a megszerzett bizonyítványokról, akkor nézze meg a ",
  "ABOUT_CERTIFICATES_LINK2": " oldalat.",
  "ABOUT_INTEREST": "Kezdi érdekelni?",
  "ABOUT_INTEREST_DOWNLOAD": "Lépjünk kapcsolatba!",
  "PROJECTS_TEXT1": "Íme néhány a projektek közül, amelyeken dolgoztam.",
  "PROJECTS_TEXT2": "Minden kártya tartalmazza a projekt nevét, leírását és a használt technológiákat.",
  "PROJECTS_TEXT3": "A nevükre kattintva átirányít a megfelelő GitHub repoba.",
  "PROJECTS_DESCRIPTION1": "A TypeScript, React és Tailwind CSS segítségével készült személyes portfólió weboldalam.",
  "PROJECTS_DESCRIPTION2": "MERN stack segítségével épített kazánkezelő alkalmazás.",
  "PROJECTS_DESCRIPTION3": "Labdarúgó adatok vizualizációja Python nyelvvel írva.",
  "PROJECTS_DESCRIPTION4": "Vite, Svelte és TypeScript segítségével készült Tic-tac-toe játék.",
  "PROJECTS_DESCRIPTION5": "Vite, Vue és TypeScript segítségével írt kalóriakövető.",
  "PROJECTS_DESCRIPTION6": "JavaScript, HTML és CSS nyelven írt kvízjáték.",
  "PROJECTS_DESCRIPTION7": "Python alkalmazások, amelyek saját maguk által választott formákat rajzolnak.",
  "PROJECTS_DESCRIPTION8": "C# alkalmazás, amely a rendezési algoritmusok teljesítményét hasonlítja össze.",
  "PROJECTS_DESCRIPTION9": "Kódolási feladatok Java nyelven.",
  "PROJECTS_DESCRIPTION10": "Feladatok, amelyeket az egyetemi éveim alatt végeztem.",
  "SKILLS_TEXT1": "Különböző projekteken dolgoztam, az alkalmazások építésétől és karbantartásától kezdve a meglévő rendszerek hatékonyságának javításáig.",
  "SKILLS_TEXT2": "Az alábbiakban azokat a technológiákat ismertetem, amelyekkel volt szerencsém együtt dolgozni az iparágban eltöltött időm alatt.",
  "SKILLS_TEXT3": "Kattintson az ikonokra, ha többet szeretne megtudni a velük kapcsolatos tapasztalataimról.",
  "SKILLS_JS": "A JavaScriptet dinamikus és interaktív funkciók létrehozására használják weboldalakon, lehetővé téve az ügyféloldali viselkedést. Interaktív webalkalmazások fejlesztésére használtam, mint például dinamikus űrlapok, valós idejű frissítések és felhasználói felületek.",
  "SKILLS_HTML": "Az HTML biztosítja a weboldalak alapvető szerkezetét olyan elemek meghatározásával, mint a címsorok, bekezdések és űrlapok. Egyszerű blogoktól komplex többoldalas alkalmazásokig különböző weboldalak alapjának felépítéséhez használtam.",
  "SKILLS_CSS": "A CSS az HTML tartalom stílusozására és vizuális formázására szolgál, beleértve az elrendezést, színeket és betűtípusokat. Reszponzív, látványos weboldalakat készítettem marketing weboldalak és portfólió oldalak számára.",
  "SKILLS_TS": "A TypeScript statikus típusokat ad a JavaScripthez, ami kiszámíthatóbbá és könnyebben hibakereshetővé teszi a kódot, különösen nagyobb projektek esetében. Nagyszabású webalkalmazások fejlesztésére használtam, ahol kulcsfontosságú volt a karbantarthatóság és a skálázhatóság, például vállalati irányítópultoknál vagy e-kereskedelmi platformoknál.",
  "SKILLS_REACT": "A React felhasználói felületek felépítésére és újrafelhasználható komponensek létrehozására szolgál, hatékony állapotkezeléssel a webalkalmazásokban. Egyszerű oldalú alkalmazások (SPA-k) fejlesztésére használtam, mint például irányítópultok, közösségi platformok vagy ügyféloldali űrlapokkal rendelkező alkalmazások.",
  "SKILLS_TAILWIND": "A Tailwind egy utilitás-alapú CSS keretrendszer, amely lehetővé teszi az alkalmazások stílusozását előre meghatározott osztályok közvetlen HTML-ben történő alkalmazásával. Gyors egyedi felületek tervezésére használtam SaaS alkalmazásokhoz és céloldalakhoz, ahol fontos volt a gyors fejlesztés és a modern megjelenés.",
  "SKILLS_NEXT": "A Next.js egy React-alapú keretrendszer, amely szerveroldali renderelést és statikus oldalak generálását biztosítja. Weboldalak és webalkalmazások készítésére használtam webes és mobilplatformokra.",
  "SKILLS_NODE": "A Node lehetővé teszi a JavaScript kiszolgáló oldali végrehajtását, amely lehetővé teszi a fejlesztők számára, hogy háttérszolgáltatásokat és API-kat építsenek JavaScript használatával. Kiszolgálóoldali alkalmazások, például RESTful API-k, valós idejű csevegőalkalmazások és háttérszolgáltatások fejlesztésére használtam webalkalmazásokhoz.",
  "SKILLS_EXPRESS": "Az Express egy webalkalmazási keretrendszer a Node.js-hez, amelyet API-k létrehozására és a kiszolgálóoldali útválasztás kezelésére használnak. Háttérszolgáltatások építésére és RESTful API-k fejlesztésére használtam web- és mobilalkalmazásokhoz.",
  "SKILLS_NET": "A .NET egy ingyenes, többplatformos keretrendszer, amelyet a Microsoft fejlesztett ki különböző típusú alkalmazások, például webes, mobil, asztali és felhőalapú megoldások létrehozására. A .NET-et használtam skálázható háttérszolgáltatások és API-k építésére, kihasználva annak képességeit webes és felhőalapú alkalmazásokhoz.",
  "SKILLS_MONGO": "A MongoDB egy NoSQL adatbázis, amely rugalmas, JSON-szerű formátumban tárolja és nyeri vissza a strukturálatlan adatokat. Magas skálázhatóságot és rugalmasságot igénylő projektekben használtam, mint például tartalomkezelő rendszerek és e-kereskedelmi platformok.",
  "SKILLS_MYSQL": "A MySQL egy nyílt forráskódú relációs adatbázis-kezelő rendszer, amely gyorsaságáról, megbízhatóságáról és egyszerű használatáról ismert. Olyan projektekben használtam, ahol hatékony adatlekérdezésre és skálázhatóságra volt szükség, különösen magas olvasási-írási arányú alkalmazások esetében.",
  "SKILLS_POSTGRE": "A PostgreSQL egy nyílt forráskódú, relációs adatbázis-kezelő rendszer, amely fejlett funkciókat kínál, például tranzakciókezelést és adatkonzisztenciát. Ezt használtam olyan projektekben, ahol komplex adatszerkezetek és nagy mennyiségű adat kezelésére volt szükség.",
  "SKILLS_JEST": "A Jest egy tesztelési keretrendszer, amelyet egységtesztek írására használnak JavaScript és TypeScript alkalmazásokhoz, biztosítva a kód megfelelő működését. Nagy projektek tesztjeinek írására használtam, hogy biztosítsam a kritikus üzleti logika megbízhatóságát és helyességét.",
  "SKILLS_JENKINS": "A Jenkins egy folyamatos integrációs szerver, amely automatizálja a build és a telepítési folyamatokat. A Jenkins-t használtam CI/CD csővezetékek létrehozására React és ASP.NET Core alkalmazások tesztelésének, buildelésének és telepítésének automatizálására.",
  "SKILLS_SONAR": "A SonarQube elemzi a kódminőséget hibák, sérülékenységek és rossz kód szokások azonosításával. A SonarQube-t használtam projektekben a kódminőség fenntartására, és a frontend és backend fejlesztés legjobb gyakorlatait biztosítottam.",
  "SKILLS_JIRA": "A Jira egy projektmenedzsment eszköz, amelyet feladatok, hibák és a szoftverfejlesztési projektek előrehaladásának nyomon követésére használnak. A sprintjeim kezelésére, problémák nyomon követésére és csapatommal való együttműködésre használtam nagyobb, hosszú távú fejlesztési projektekben.",
  "SKILLS_FIGMA": "A Figma egy együttműködési tervező eszköz, amelyet drótvázak, prototípusok és felhasználói felületek tervezésére használnak web- és mobilalkalmazásokhoz. Együttműködtem a tervezőkkel, áttekintettem a prototípusokat, és gondoskodtam arról, hogy a felület megfeleljen a tervezési elvárásoknak.",
  "SKILLS_GIT": "A Git egy verziókövető rendszer, amely követi a kód változásait, lehetővé téve az együttműködést és a verziókezelést. Minden szoftverfejlesztési projektemben használtam a verziókezeléshez, fejlesztőkkel való együttműködéshez és a változások nyomon követéséhez.",
  "SKILLS_GITHUB": "A GitHub egy platform a Git tárolók hosztolására, amely lehetővé teszi a kód megosztását, az együttműködést és a projektmenedzsmentet. Kódmegosztásra, pull requestek kezelésére és nyílt forráskódú és privát csapatprojektekben való együttműködésre használtam.",
  "SKILLS_GITLAB": "A GitLab egy alternatíva a GitHub-hoz, amely Git tároló hosztolást kínál beépített CI/CD folyamatokkal és projektmenedzsment funkciókkal. CI/CD-t igénylő DevOps-fókuszú projektekben használtam, ahol fontos volt az automatizálás és a telepítés.",
  "SKILLS_BUTTON": "Bezárni",
  "CERTIFICATES_TEXT": "Az alábbiakban felsorolom az eddig megszerzett tanúsítványaimat akadémiai pályafutásom során.",
  "CERTIFICATES_CAE_TITLE": "Cambridge Advanced English Tanúsítvány",
  "CERTIFICATES_MOD_TITLE": "Tanári Modul Diploma",
  "CERTIFICATES_COM_TITLE": "Collegium Varadinum Tudományos Diákkonferencia Dicséret",
  "CERTIFICATES_SOL1_TITLE": "SoloLearn ReactJS Tanúsítvány",
  "CERTIFICATES_SOL2_TITLE": "SoloLearn JavaScript Tanúsítvány",
  "CERTIFICATES_SOL3_TITLE": "SoloLearn HTML Tanúsítvány",
  "CERTIFICATES_SOL4_TITLE": "SoloLearn CSS Tanúsítvány",
  "CERTIFICATES_SOL5_TITLE": "SoloLearn C# Tanúsítvány",
  "CERTIFICATES_SOL6_TITLE": "SoloLearn Java Tanúsítvány",
  "CERTIFICATES_SOL7_TITLE": "SoloLearn Python Tanúsítvány",
  "CERTIFICATES_SOL8_TITLE": "SoloLearn SQL Tanúsítvány",
  "CERTIFICATES_CAE": "Tanúsítvány a Cambridge Advanced English tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_MOD": "Tanúsítvány a nemzeti tanári modul sikeres elvégzéséért.",
  "CERTIFICATES_COM": "Dicséret a mesterséges intelligencia és annak társadalmi hatásai témában végzett kutatás sikeres bemutatásáért.",
  "CERTIFICATES_SOL1": "Tanúsítvány a SoloLearn ReactJS tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_SOL2": "Tanúsítvány a SoloLearn JavaScript tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_SOL3": "Tanúsítvány a SoloLearn HTML tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_SOL4": "Tanúsítvány a SoloLearn CSS tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_SOL5": "Tanúsítvány a SoloLearn C# tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_SOL6": "Tanúsítvány a SoloLearn Java tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_SOL7": "Tanúsítvány a SoloLearn Python tanfolyam sikeres elvégzéséért.",
  "CERTIFICATES_SOL8": "Tanúsítvány a SoloLearn SQL tanfolyam sikeres elvégzéséért.",
  "FOOTER_COPYRIGHT1": "Szerzői jogok",
  "FOOTER_COPYRIGHT2": "Minden jog fenntartva."
}
