{
  "HOME": "Otthon",
  "ABOUT": "Rólam",
  "PROJECTS": "Projektek",
  "SKILLS": "Képessegek",
  "CERTIFICATES": "Diplomák",
  "HOBBIES": "Szabadidőmben szeretek sportolni, könyveket olvasni, videojátékokkal játszani, tévéműsorokat nézni és mellékprojekteket fejleszteni.",
  "CV_DOWNLOAD": "Töltse le az önéletrajzomat",
  "COVER_LETTER_DOWNLOAD": "Töltse le a motivációs levelemet",
  "HOME_GITHUB": "GitHub fiók",
  "HOME_LINKEDIN": "LinkedIn fiók",
  "HOME_HELLO": "Helló! Szakácsi Ferenc-Ádám vagyok.",
  "HOME_WELCOME": "Üdvözlöm a személyes weboldalamon.",
  "HOME_ABOUT": "Elkötelezett és lelkes szoftverfejlesztő, aki mély szenvedélyt érez a folyamatos önfejlesztés iránt. Szakmai utamat az a vágy vezérli, hogy mind a puha, mind a kemény készségek terén kiemelkedő teljesítményt nyújtsak, miközben elősegítem a kollégákkal való produktív együttműködést. Szilárdan hiszem, hogy a nagyszerű szoftverfejlesztés túlmutat a kódon; a csapatmunkáról, a kommunikációról és az alkalmazkodóképességről szól.",
  "HOME_EXPERIENCE": "Közel 2 évig dolgoztam Full stack szoftverfejlesztőként. Tapasztalattal rendelkezem webes alkalmazások, mobil alkalmazások és asztali alkalmazások fejlesztésében.",
  "HOME_EDUCATION": "Informatikai háttérrel rendelkezem, és a Nagyváradi egyetemen szereztem alapképzést. Jelenleg a mesterképzést végzem számítástechnikai szoftvermérnöki szakon.",
  "ABOUT_ABOUT": "Rólam",
  "ABOUT_WORK": "Munkahelyi tapasztalat",
  "ABOUT_EXPERIENCE": "A DevNest és a Climarol Prest szoftverfejlesztőjeként az elmúlt 2 évben a szoftverfejlesztés különböző területein szereztem tapasztalatot. Különböző projekteken dolgoztam, a webes alkalmazások építésétől és karbantartásától kezdve a meglévő rendszerek hatékonyságának javításáig.",
  "ABOUT_EDUCATION_TITLE": "Tanulmányok",
  "ABOUT_EDUCATION": "A Nagyváradi egyetem informatika szakán szereztem alapképzést. Jelenleg ugyanott veszek részt szoftvermérnöki mesterképzésben. A tanulmányi utam során a problémamegoldás, a csapatmunka és az alkalmazkodóképesség terén szereztem kritikus készségeket.",
  "ABOUT_HOBBIES": "Hobbik",
  "ABOUT_SKILLS_LIST": "Az alábbiakban felsorolva megtalálja az általam a projektjeimben használt technológiákat:",
  "ABOUT_SKILLS_LINK1": "Ha részletesebb információt szeretne kapni a megszerzett képességeimről, akkor nézze meg a ",
  "ABOUT_SKILLS_LINK2": " oldalat.",
  "ABOUT_PROJECTS_LINK1": "Egyetemi és szakmai pályafutásom során számos projekten dolgoztam. Részletesebb információért, kérem kattintson a ",
  "ABOUT_PROJECTS_LINK2": " oldalra.",
  "ABOUT_CERTIFICATES_LINK1": "Oktatási és szakmai pályafutásom során számos bizonyítványt szereztem. Ha részletesebb információt szeretne kapni a megszerzett bizonyítványokról, akkor nézze meg a ",
  "ABOUT_CERTIFICATES_LINK2": " oldalat.",
  "ABOUT_INTEREST": "Kezdi érdekelni?",
  "ABOUT_INTEREST_DOWNLOAD": "Ebben az esetben lépjünk kapcsolatba!",
  "PROJECTS_TEXT1": "Íme néhány a projektek közül, amelyeken dolgoztam.",
  "PROJECTS_TEXT2": "Minden kártya tartalmazza a projekt nevét, leírását és a használt technológiákat.",
  "PROJECTS_TEXT3": "A nevükre kattintva átirányít a megfelelő GitHub repoba.",
  "PROJECTS_DESCRIPTION1": "A TypeScript, React és Tailwind CSS segítségével készült személyes portfólió weboldalam.",
  "PROJECTS_DESCRIPTION2": "MERN stack segítségével épített kazánkezelő alkalmazás.",
  "PROJECTS_DESCRIPTION3": "Labdarúgó adatok vizualizációja Python nyelvvel írva.",
  "PROJECTS_DESCRIPTION4": "Vite, Svelte és TypeScript segítségével készült Tic-tac-toe játék.",
  "PROJECTS_DESCRIPTION5": "Vite, Vue és TypeScript segítségével írt kalóriakövető.",
  "PROJECTS_DESCRIPTION6": "JavaScript, HTML és CSS nyelven írt kvízjáték.",
  "PROJECTS_DESCRIPTION7": "Python alkalmazások, amelyek saját maguk által választott formákat rajzolnak.",
  "PROJECTS_DESCRIPTION8": "C# alkalmazás, amely a rendezési algoritmusok teljesítményét hasonlítja össze.",
  "PROJECTS_DESCRIPTION9": "Kódolási feladatok Java nyelven.",
  "PROJECTS_DESCRIPTION10": "Feladatok, amelyeket az egyetemi éveim alatt végeztem.",
  "SKILLS_TEXT1": "Különböző projekteken dolgoztam, az alkalmazások építésétől és karbantartásától kezdve a meglévő rendszerek hatékonyságának javításáig.",
  "SKILLS_TEXT2": "Az alábbiakban azokat a technológiákat ismertetem, amelyekkel volt szerencsém együtt dolgozni az iparágban eltöltött időm alatt.",
  "SKILLS_TEXT3": "Kattintson az ikonokra, ha többet szeretne megtudni a velük kapcsolatos tapasztalataimról.",
  "FOOTER_COPYRIGHT1": "Szerzői jogok",
  "FOOTER_COPYRIGHT2": "Minden jog fenntartva."
}
