{
  "HOME": "Acasă",
  "ABOUT": "Despre mine",
  "PROJECTS": "Proiecte",
  "SKILLS": "Competențe",
  "CERTIFICATES": "Certificate",
  "HOBBIES": "În timpul meu liber, îmi place să fac sport, să citesc cărți, să joc jocuri video, să mă uit la emisiuni TV și să dezvolt proiecte personale.",
  "CV_DOWNLOAD": "Descărcați CV-ul meu",
  "COVER_LETTER_DOWNLOAD": "Descărcați scrisoarea mea de intenție",
  "HOME_GITHUB": "Profil GitHub",
  "HOME_LINKEDIN": "Profil LinkedIn",
  "HOME_HELLO": "Salutare! Sunt Szakacsi Ferenc-Adam.",
  "HOME_WELCOME": "Bine ați venit pe site-ul meu personal.",
  "HOME_ABOUT": "Dezvoltator software dedicat și entuziast, cu o pasiune profundă pentru autodepășire continuă. Călătoria mea profesională este condusă de dorința de a excela atât în abilitățile soft, cât și în cele hard, promovând în același timp colaborări productive cu colegii. Cred cu tărie că o dezvoltare software excelentă se extinde dincolo de cod; este vorba despre munca în echipă, comunicare și adaptabilitate.",
  "HOME_EXPERIENCE": "Am lucrat aproape 2 ani ca Full stack software developer. Am experiență în dezvoltarea de aplicații web, aplicații mobile și aplicații desktop.",
  "HOME_EDUCATION": "Am o pregătire în domeniul informaticii și dețin o diplomă de licență de la Universiatea din Oradea. În prezent îmi fac masteratul în ingineria programelor informatice.",
  "ABOUT_ABOUT": "Despre mine",
  "ABOUT_WORK": "Experiență profesională",
  "ABOUT_EXPERIENCE": "În calitate de dezvoltator software la DevNest și Climarol Prest, am dobândit experiență în diverse domenii ale dezvoltării software în ultimii 2 ani. Am lucrat la diverse proiecte, de la crearea și întreținerea de aplicații web la îmbunătățirea eficienței sistemelor existente.",
  "ABOUT_EDUCATION_TITLE": "Studii",
  "ABOUT_EDUCATION": "Am absolvit cu o diplomă de licență în Informatică la Universitatea din Oradea. În prezent urmez tot acolo masteratul în inginerie software. Călătoria mea academică m-a învățat abilități critice în rezolvarea problemelor, lucrul în echipă și adaptabilitate.",
  "ABOUT_HOBBIES": "Hobby-uri",
  "ABOUT_SKILLS_LIST": "Mai jos găsiți lista cu tehnologiile pe care le-am folosit în proiectele mele:",
  "ABOUT_SKILLS_LINK1": "Pentru informații mai detaliate despre competențele mele dobândite, puteți consulta secțiunea ",
  "ABOUT_SKILLS_LINK2": " a paginii.",
  "ABOUT_PROJECTS_LINK1": "De-a lungul carierei mele universitare și profesionale, am lucrat la mai multe proiecte. Pentru informații mai detaliate, puteți vizita secțiunea ",
  "ABOUT_PROJECTS_LINK2": " a paginii.",
  "ABOUT_CERTIFICATES_LINK1": "De-a lungul carierei mele educaționale și profesionale, am obținut mai multe certificate. Pentru informații mai detaliate despre certificatele dobândite, puteți consulta secțiunea ",
  "ABOUT_CERTIFICATES_LINK2": " a paginii.",
  "ABOUT_INTEREST": "Sunteți interesat?",
  "ABOUT_INTEREST_DOWNLOAD": "În acest caz, haideți să luăm legătura!",
  "FOOTER_COPYRIGHT": "Toate drepturile rezervate."
}
