{
  "HOME": "Acasă",
  "ABOUT": "Despre mine",
  "PROJECTS": "Proiecte",
  "SKILLS": "Competențe",
  "CERTIFICATES": "Certificate",
  "HOBBIES": "În timpul meu liber, îmi place să fac sport, să citesc cărți, să joc jocuri video, să mă uit la emisiuni TV și să dezvolt proiecte personale.",
  "CV_DOWNLOAD": "Descărcați CV-ul",
  "COVER_LETTER_DOWNLOAD": "Descărcați scrisoarea de intenție",
  "HOME_GITHUB": "Profil GitHub",
  "HOME_LINKEDIN": "Profil LinkedIn",
  "HOME_HELLO": "Salutare! Sunt Szakacsi Ferenc-Adam.",
  "HOME_WELCOME": "Bine ați venit pe paginea mea personală.",
  "HOME_ABOUT": "Dezvoltator software dedicat și entuziast, cu o pasiune profundă pentru autodepășire continuă. Călătoria mea profesională este condusă de dorința de a excela atât în abilitățile soft, cât și în cele hard, promovând în același timp colaborări productive cu colegii. Cred cu tărie că o dezvoltare software excelentă se extinde dincolo de cod; este vorba despre munca în echipă, comunicare și adaptabilitate.",
  "HOME_EXPERIENCE": "Am lucrat ca dezvoltator full stack timp de 2 ani, dezvoltând aplicații web, mobile și desktop. Pe parcursul activității mele, am utilizat metodologiile Agile pentru a asigura adaptabilitatea și livrarea la timp a funcționalităților. Am menținut întotdeauna cele mai înalte standarde de codare și testare, concentrându-mă pe scrierea unui cod fiabil, scalabil și bine testat pentru a livra aplicații de înaltă calitate pe toate platformele.",
  "HOME_EDUCATION": "Am o pregătire în informatică și dețin o diplomă de licență de la Universitatea din Oradea. În prezent, urmez un program de masterat în ingineria software.",
  "ABOUT_ABOUT": "Despre mine",
  "ABOUT_WORK": "Experiență profesională",
  "ABOUT_EXPERIENCE": "Ca dezvoltator software la DevNest și Climarol Prest, am acumulat peste 2 ani de experiență diversă în mai multe domenii ale dezvoltării software. Munca mea a implicat dezvoltarea și întreținerea aplicațiilor web complexe, asigurând scalabilitatea, performanța și compatibilitatea acestora cu diferite browsere. Am contribuit la proiecte full stack, folosind tehnologii moderne precum React, TypeScript, JavaScript, HTML și CSS pe partea de frontend, și ASP.NET și Node.js pe backend. În plus față de construirea de aplicații noi, m-am concentrat pe optimizarea sistemelor existente pentru a le îmbunătăți eficiența, implementând îmbunătățiri de performanță, refactorizând codurile pentru o mai bună întreținere și integrând cadre de testare automată pentru a crește fiabilitatea codului. Urmând metodologiile Agile, am colaborat strâns cu echipele cross-funcționale pentru a livra funcționalități care să îndeplinească atât nevoile utilizatorilor, cât și obiectivele de afaceri. Aceste experiențe mi-au perfecționat abilitățile de dezvoltare front-end și back-end, gestionarea bazelor de date, crearea de API-uri și rezolvarea eficientă a problemelor, transformându-mă într-un dezvoltator versatil și adaptabil.",
  "ABOUT_EDUCATION_TITLE": "Studii",
  "ABOUT_EDUCATION": "Am absolvit cu o diplomă de licență în Informatică la Universitatea din Oradea. În prezent urmez tot acolo masteratul în inginerie software. Călătoria mea academică m-a învățat abilități critice în rezolvarea problemelor, lucrul în echipă și adaptabilitate.",
  "ABOUT_LANGUAGES_TITLE": "Limbi vorbite",
  "ABOUT_LANGUAGES": "Vorbesc maghiară și română la nivel nativ, iar în engleză la nivel C2, certificat prin diploma CAE.",
  "ABOUT_HOBBIES": "Hobby-uri",
  "ABOUT_SKILLS_LIST": "Mai jos găsiți lista cu tehnologiile pe care le-am folosit în proiectele mele:",
  "ABOUT_SKILLS_LINK1": "Pentru informații mai detaliate despre competențele mele dobândite, puteți consulta secțiunea ",
  "ABOUT_SKILLS_LINK2": " a paginii.",
  "ABOUT_PROJECTS_LINK1": "De-a lungul carierei mele universitare și profesionale, am lucrat la mai multe proiecte. Pentru informații mai detaliate, puteți vizita secțiunea ",
  "ABOUT_PROJECTS_LINK2": " a paginii.",
  "ABOUT_CERTIFICATES_LINK1": "De-a lungul carierei mele educaționale și profesionale, am obținut mai multe certificate. Pentru informații mai detaliate despre certificatele dobândite, puteți consulta secțiunea ",
  "ABOUT_CERTIFICATES_LINK2": " a paginii.",
  "ABOUT_INTEREST": "Sunteți interesat?",
  "ABOUT_INTEREST_DOWNLOAD": "Haideți să luăm legătura!",
  "PROJECTS_TEXT1": "Iată câteva dintre proiectele la care am lucrat.",
  "PROJECTS_TEXT2": "Fiecare card conține numele proiectului, descrierea și tehnologiile utilizate.",
  "PROJECTS_TEXT3": "Dacă faceți clic pe numele lor, veți fi redirecționat către repositoriul GitHub respectiv.",
  "PROJECTS_DESCRIPTION1": "Site-ul meu personal de portofoliu construit cu TypeScript, React și Tailwind CSS.",
  "PROJECTS_DESCRIPTION2": "Aplicație de gestionare a cazanelor construită cu MERN stack.",
  "PROJECTS_DESCRIPTION3": "Vizualizare de date despre fotbal scrisă în Python.",
  "PROJECTS_DESCRIPTION4": "Joc Tic-tac-toe construit cu Vite, Svelte și TypeScript.",
  "PROJECTS_DESCRIPTION5": "Tracker de calorii arse scris cu Vite, Vue și TypeScript.",
  "PROJECTS_DESCRIPTION6": "Joc de tip quiz show scris în JavaScript, HTML și CSS.",
  "PROJECTS_DESCRIPTION7": "Aplicații Python care desenează forme pe care le aleg singure.",
  "PROJECTS_DESCRIPTION8": "Aplicație C# care compară performanțele algoritmilor de sortare.",
  "PROJECTS_DESCRIPTION9": "Probleme rezolvate în Java.",
  "PROJECTS_DESCRIPTION10": "Sarcini pe care le-am făcut în timpul anilor de facultate.",
  "SKILLS_TEXT1": "Am lucrat la diverse proiecte, de la construirea și întreținerea de aplicații full-stack la îmbunătățirea eficienței sistemelor existente.",
  "SKILLS_TEXT2": "Mai jos sunt prezentate tehnologiile cu care am avut plăcerea să lucrez în timpul perioadei mele în industrie.",
  "SKILLS_TEXT3": "Faceți clic pe icoane pentru a afla mai multe despre experiența mea cu fiecare dintre ele.",
  "SKILLS_JS": "JavaScript este folosit pentru a crea funcționalități dinamice și interactive pe paginile web, permițând comportamentele pe partea de client. L-am folosit pentru dezvoltarea aplicațiilor web interactive, cum ar fi formularele dinamice, actualizările în timp real și interfețele atractive.",
  "SKILLS_HTML": "HTML oferă structura de bază a paginilor web prin definirea elementelor precum titlurile, paragrafele și formularele. L-am folosit pentru a construi fundația diferitelor site-uri web, de la bloguri simple la aplicații complexe cu mai multe pagini.",
  "SKILLS_CSS": "CSS este folosit pentru a stiliza și formata vizual conținutul HTML, inclusiv layout-uri, culori și fonturi. L-am folosit pentru a crea pagini web responsive și atractive vizual pentru proiecte precum site-uri de marketing și portofolii.",
  "SKILLS_TS": "TypeScript adaugă tipuri statice JavaScript-ului, făcând codul mai predictibil și mai ușor de depanat, în special în proiectele mari. L-am folosit pentru a construi aplicații web de mare anvergură, unde mentenabilitatea și scalabilitatea erau esențiale, cum ar fi dashboard-urile enterprise sau platformele de e-commerce.",
  "SKILLS_REACT": "React este folosit pentru a construi interfețe de utilizator cu componente reutilizabile și pentru a gestiona eficient starea în aplicațiile web. L-am folosit pentru dezvoltarea aplicațiilor single-page (SPA), cum ar fi dashboard-uri, platforme sociale sau aplicații complexe bazate pe formulare.",
  "SKILLS_TAILWIND": "Tailwind este un framework CSS bazat pe utilități, care permite dezvoltatorilor să stilizeze aplicațiile prin aplicarea claselor predefinite direct în HTML. L-am folosit pentru a proiecta rapid interfețe personalizate pentru proiecte precum aplicații SaaS și pagini de destinație, unde viteza de dezvoltare și un aspect modern erau importante.",
  "SKILLS_NEXT": "Next.js este un framework bazat pe React care oferă redare pe partea serverului și generare de site-uri statice. L-am folosit pentru a construi site-uri web și aplicații web pentru platformele web și mobile.",
  "SKILLS_NODE": "Node permite execuția JavaScript pe partea de server, permițând dezvoltatorilor să construiască servicii backend și API-uri folosind JavaScript. L-am folosit pentru a construi aplicații de server, cum ar fi API-uri RESTful, aplicații de chat în timp real și servicii backend pentru aplicații web.",
  "SKILLS_EXPRESS": "Express este un framework de aplicații web pentru Node.js, folosit pentru a crea API-uri și pentru a gestiona rutarea pe partea de server. L-am folosit pentru a construi servicii backend și pentru a dezvolta API-uri RESTful pentru aplicații web și mobile.",
  "SKILLS_NET": ".NET este un framework gratuit și multi-platformă dezvoltat de Microsoft pentru crearea diverselor tipuri de aplicații, inclusiv soluții web, mobile, desktop și cloud. Am folosit .NET pentru a construi servicii backend scalabile și API-uri, valorificând capacitățile sale pentru aplicații web și bazate pe cloud.",
  "SKILLS_MONGO": "MongoDB este o bază de date NoSQL folosită pentru a stoca și recupera date nestructurate într-un format flexibil, asemănător cu JSON. L-am folosit în proiecte care necesitau scalabilitate mare și flexibilitate, cum ar fi sistemele de management al conținutului și platformele de e-commerce.",
  "SKILLS_POSTGRE": "PostgreSQL este un sistem de gestionare a bazelor de date relaționale, open-source, care oferă funcționalități avansate, cum ar fi gestionarea tranzacțiilor și consistența datelor. L-am folosit în proiecte care necesitau manipularea unor structuri complexe de date și gestionarea unor volume mari de informații.",
  "SKILLS_JEST": "Jest este un framework de testare folosit pentru a scrie teste unitare pentru aplicațiile JavaScript și TypeScript, asigurându-se că codul funcționează conform așteptărilor. L-am folosit pentru a scrie teste în proiecte mari, asigurându-mă de fiabilitatea și corectitudinea logicii de afaceri critice.",
  "SKILLS_POSTMAN": "Postman este un instrument folosit pentru testarea API-urilor prin trimiterea cererilor și inspectarea răspunsurilor. Am folosit Postman pentru a testa API-urile RESTful în timpul dezvoltării aplicațiilor web pentru a asigura funcționalitatea corectă și gestionarea răspunsurilor.",
  "SKILLS_JENKINS": "Jenkins este un server de integrare continuă care automatizează procesul de build și deployment. Am folosit Jenkins pentru a configura pipeline-uri CI/CD pentru automatizarea testelor, build-ului și deployment-ului aplicațiilor React și ASP.NET Core.",
  "SKILLS_SONAR": "SonarQube analizează calitatea codului identificând bug-uri, vulnerabilități și mirosuri de cod. Am implementat SonarQube în proiecte pentru a menține calitatea codului și a asigura respectarea celor mai bune practici în dezvoltarea frontend și backend.",
  "SKILLS_JIRA": "Jira este un instrument de management de proiect folosit pentru a urmări sarcinile, bug-urile și progresul în proiectele de dezvoltare software. L-am folosit pentru a gestiona sprinturile, a urmări problemele și a colabora cu echipa mea în proiecte mari și continue de dezvoltare software.",
  "SKILLS_FIGMA": "Figma este un instrument colaborativ de design folosit pentru a crea wireframe-uri, prototipuri și design-uri UI pentru aplicații web și mobile. L-am folosit pentru a colabora cu designerii, a revizui prototipuri și a mă asigura că implementarea front-end corespunde designului intenționat.",
  "SKILLS_GIT": "Git este un sistem de control al versiunilor care urmărește modificările în cod, permițând colaborarea și gestionarea versiunilor. L-am folosit în toate proiectele mele de software pentru a gestiona controlul versiunilor, a colabora cu alți dezvoltatori și a urmări schimbările de-a lungul timpului.",
  "SKILLS_GITHUB": "GitHub este o platformă pentru găzduirea depozitelor Git, facilitând partajarea codului, colaborarea și managementul proiectelor. L-am folosit pentru a partaja codul, a gestiona pull request-urile și a colabora în proiecte open-source sau private de echipă.",
  "SKILLS_GITLAB": "GitLab este o alternativă la GitHub, oferind găzduire pentru depozite Git cu pipeline-uri CI/CD integrate și funcții de management al proiectelor. L-am folosit în proiecte axate pe DevOps, unde integrarea continuă și livrarea continuă (CI/CD) au fost importante pentru automatizare și implementare.",
  "SKILLS_BUTTON": "Închide",
  "CERTIFICATES_TEXT": "Mai jos sunt certificatele obținute până acum în cariera mea academică.",
  "CERTIFICATES_CAE_TITLE": "Certificat Cambridge Advanced English",
  "CERTIFICATES_MOD_TITLE": "Diplomă Modul de Predare",
  "CERTIFICATES_COM_TITLE": "Mențiune Conferința Științifică Studențească Collegium Varadinum",
  "CERTIFICATES_SOL1_TITLE": "Certificat SoloLearn ReactJS",
  "CERTIFICATES_SOL2_TITLE": "Certificat SoloLearn JavaScript",
  "CERTIFICATES_SOL3_TITLE": "Certificat SoloLearn HTML",
  "CERTIFICATES_SOL4_TITLE": "Certificat SoloLearn CSS",
  "CERTIFICATES_SOL5_TITLE": "Certificat SoloLearn C#",
  "CERTIFICATES_SOL6_TITLE": "Certificat SoloLearn Java",
  "CERTIFICATES_SOL7_TITLE": "Certificat SoloLearn Python",
  "CERTIFICATES_SOL8_TITLE": "Certificat SoloLearn SQL",
  "CERTIFICATES_CAE": "Certificat acordat după finalizarea cu succes a cursului Cambridge Advanced English.",
  "CERTIFICATES_MOD": "Certificat acordat după finalizarea cu succes a modulului național de predare.",
  "CERTIFICATES_COM": "Mențiune acordată după prezentarea reușită a cercetării realizate în domeniul inteligenței artificiale și efectele acesteia asupra societății.",
  "CERTIFICATES_SOL1": "Certificat acordat după finalizarea cu succes a cursului SoloLearn ReactJS.",
  "CERTIFICATES_SOL2": "Certificat acordat după finalizarea cu succes a cursului SoloLearn JavaScript.",
  "CERTIFICATES_SOL3": "Certificat acordat după finalizarea cu succes a cursului SoloLearn HTML.",
  "CERTIFICATES_SOL4": "Certificat acordat după finalizarea cu succes a cursului SoloLearn CSS.",
  "CERTIFICATES_SOL5": "Certificat acordat după finalizarea cu succes a cursului SoloLearn C#.",
  "CERTIFICATES_SOL6": "Certificat acordat după finalizarea cu succes a cursului SoloLearn Java.",
  "CERTIFICATES_SOL7": "Certificat acordat după finalizarea cu succes a cursului SoloLearn Python.",
  "CERTIFICATES_SOL8": "Certificat acordat după finalizarea cu succes a cursului SoloLearn SQL.",
  "FOOTER_COPYRIGHT1": "Drepturi de autor",
  "FOOTER_COPYRIGHT2": "Toate drepturile rezervate."
}
